{
  "data": [
    {
      "id": 1,
      "image": "/images/realtime-chat.png",
      "title": "Realtime Chat",
      "fullTitle": "Разработка клиентской части платформы Realtime Chat",
      "description": [
        "Платформа Realtime Chat, на которой я тренировался в начале знакомства с React. Изначально была обычным чатом, но с каждым обновлением получала все больше функциональных возможностей. Начиная с базовой функциональности обмена сообщениями, платформа теперь предлагает ряд дополнительных функций, таких как добавление аватарки пользователя двумя различными способами, возможность изменения имени и многое другое.",
        "Realtime Chat был моим первым опытом работы с backend и основами баз данных. Я выбрал сервис Firebase для хранения данных и управления бэкэндом платформы. Firebase обеспечивает простой и гибкий способ работы с базой данных, позволяя мне сосредоточиться на развитии функциональности платформы.",
        "Однако из-за большого количества заказчиков на данный момент, у меня не хватает времени для того чтобы протестировать ПР в github глобального обновления) Но я активно работаю над этим и стремлюсь завершить эту задачу в ближайшем далёком будущем. Одной из главных особенностей Realtime Chat в грядущем обновлении будет возможность создания индивидуальных чатов между двумя пользователями или групповых чатов с несколькими участниками. Это позволяет пользователям общаться и сотрудничать эффективно, обмениваясь информацией и идеями."
      ],
      "deploy": "https://ilyagaltsev.github.io/RealTime-Chat",
      "github": "https://github.com/IlyaGaltsev/RealTime-Chat",
      "technologies": ["React", "SCSS", "Firebase"]
    },
    {
      "id": 2,
      "image": "/images/realtime-chat_mobile.png",
      "title": "Realtime Chat Mobile",
      "fullTitle": "Разработка клиентской части платформы Realtime Chat",
      "description": [
        "Realtime Chat Mobile - это мобильное приложение, предоставляющее пользователям возможность общаться в реальном времени. На данный момент в приложении реализованы основные функции чата и возможность смены аватарки и имени пользователя.",
        "Однако в ближайшем будущем я планирую расширить функциональность приложения и привести его в соответствие с веб-версией Realtime Chat. Для этого я планирую переписать приложение с использованием инструментов командной строки (CLI) вместо Expo. Такой подход позволит мне иметь больше гибкости и возможностей, поскольку ограничения Expo будут сняты.",
        "Кроме того, я также рассматриваю возможность внедрения нативного кода в мобильное приложение. Это даст мне больше контроля над функциональностью и производительностью приложения, а также откроет новые возможности для интеграции с нативными функциями операционных систем iOS и Android.",
        "Проект был создан с целью разработки полноценной системы, объединяющей веб- и мобильные версии Realtime Chat. У меня возникла потребность предоставить пользователям возможность общаться в реальном времени, независимо от того, на каком устройстве они находятся.",
        "Разработка полноценной системы, включающей и веб, и мобильные версии, имеет несколько преимуществ. Во-первых, она обеспечивает максимальную доступность и удобство для пользователей, позволяя им общаться и обмениваться информацией на любом устройстве по своему выбору - будь то компьютер, планшет или смартфон.",
        "Во-вторых, объединение веб- и мобильных версий позволяет мне создать единое и согласованное пользовательское впечатление на всех платформах. Это помогает установить привычную и интуитивно понятную среду общения для пользователей, независимо от того, какое устройство они используют.",
        "Кроме того, разработка полноценной системы Realtime Chat также позволяет мне использовать и переиспользовать код, логику и компоненты между веб- и мобильными версиями. Это повышает эффективность разработки, упрощает поддержку и обновление системы, а также снижает затраты на разработку.",
        "В целом, создание полноценной системы из веб- и мобильных версий Realtime Chat является стратегическим решением, позволяющим удовлетворить потребности пользователей в коммуникации на различных платформах и создать удобную и единообразную среду общения."
      ],
      "deploy": "",
      "github": "https://github.com/IlyaGaltsev/RealTime-Chat",
      "technologies": ["React-Native", "Styled-components"]
    },
    {
      "id": 4,
      "image": "/images/my-site.png",
      "title": "Сайт-портфолио",
      "fullTitle": "Разработка сайта-портфолио",
      "description": [
        "Рад представить вам мой сайт-портфолио, который изначально я разработал с использованием технологий React.js. Переписывание сайта с React.js на Next.js с применением TypeScript было необходимо для улучшения SEO и оптимизации времени загрузки страниц.",
        "Одна из главных причин перехода на Next.js состояла в возможности предварительной загрузки страниц, что значительно улучшает производительность сайта и сокращает время ожидания для пользователей. Теперь мой сайт более быстрый и отзывчивый.",
        "Для размещения сайта я выбрал платформу Vercel, так как она предоставляет бесплатный хостинг и простой процесс развертывания. Это позволяет мне без проблем поддерживать и обновлять мой сайт-портфолио.",
        "Основная цель создания этого сайта-портфолио - найти работу или привлечь клиентов для сотрудничества над интересными проектами. Я стремлюсь продемонстрировать свои навыки и опыт разработки, а также предоставить информацию о своих проектах и достижениях.",
        "Кроме того, на моем сайте также имеется блог, где я публикую статьи и заметки о различных аспектах веб-разработки, новых технологиях и трендах в отрасли. Это позволяет мне делиться своими знаниями и опытом с другими людьми, а также установить контакт с единомышленниками."
      ],
      "deploy": "",
      "github": "https://github.com/IlyaGaltsev/MySite",
      "technologies": ["Next", "TS", "SCSS"]
    },
    {
      "id": 41,
      "image": "/images/mobiltest.png",
      "title": "Мобилтест",
      "fullTitle": "Разработка клиентской части платформы Мобилтест",
      "description": [
        "Мобилтест – платформа, предоставляющая компаниям и пользователям автоматизировать процесс обучения. В рамках проекта я занимался разработкой фронтенда и версткой. Для этого я использовал фреймворк Nuxt.js и препроцессор SCSS.",
        "На клиентской стороне использовался фреймворк Nuxt.js, основанный на Vue.js, чтобы создать масштабируемое и эффективное веб-приложение. Nuxt.js позволил мне быстро настроить окружение разработки, управление маршрутизацией и рендерингом на стороне сервера, что значительно повысило производительность и SEO-оптимизацию платформы.",
        "Для создания стилей и внешнего вида платформы mobiltest.ru я использовал язык стилей SCSS. SCSS предоставил мне возможность организовать структуру стилей, использовать переменные, миксины и другие полезные функции, упрощая тем самым разработку и поддержку стилей платформы.",
        "Мне было приятно работать над проектом и внести свой вклад в разработку фронтенда и верстку. Больше на Vue писать не буду)) ввиду его строгости к коду и какой то структуре, которая отстуствует в React, может на то он и фреймворк"
      ],
      "deploy": "https://mobiltest.ru/lk/17",
      "github": "",
      "technologies": ["Nuxt", "SCSS"]
    },
    {
      "id": 5,
      "image": "/images/prioritet-lift.png",
      "title": "ООО ПриоритетЛифт",
      "fullTitle": "Разработка сайта компании ООО ПриоритетЛифт",
      "description": [
        "После прохождения практики в Everest, мне попался проект, в рамках которого требовалось реализовать дизайн и создать лендинг. Для выполнения этой задачи я выбрал конструктор Webflow в качестве инструмента. Благодаря его простоте использования, я смог быстро нарисовать и собрать сайт.",
        "Однако, я столкнулся с ограничениями, которые свойственны большинству конструкторов сайтов. Некоторые функциональности, которые я хотел реализовать, требовали обходных путей и дополнительных усилий. В конечном итоге, я осознал, что конструкторы больше подходят в качестве дизайнерского инструмента, чем разработческого.",
        "Это стало поводом для меня, чтобы продолжить изучение JavaScript и React. Они предоставляют больше гибкости и возможностей для создания интерактивных и сложных веб-приложений. Погружение в программирование дало мне возможность расширить свои навыки и предоставило больше свободы в реализации различных идей.",
        "Изучение JavaScript и React позволило мне стать более самостоятельным разработчиком, способным создавать не только привлекательный дизайн, но и функциональные веб-приложения. Эти инструменты дают больше возможностей для настройки и расширения функциональности сайтов, что помогает мне достичь поставленных целей более эффективно."
      ],
      "deploy": "https://howeverdigital.webflow.io/",
      "github": "/",
      "technologies": ["Webflow", "JS"]
    },
    {
      "id": 6,
      "image": "/images/book-military.png",
      "title": "Учебно-методическое пособие",
      "fullTitle": "Подготовка по основам военной службы в ходе проведения учебных сборов",
      "description": [
        "Мой первый production проект, который я разработал и поддерживаю до сих пор, является пособием, предназначенным для руководителей и преподавателей-организаторов ОБЖ в учебных заведениях. Это пособие помогает им эффективно проводить 5-дневные учебные сборы по основам военной службы с допризывной молодежью.",
        "В ходе работы над этим проектом было несколько итераций. Изначально он был разработан на React с использованием JavaScript. Однако, пока я ожидал получение необходимых материалов, я заинтересовался TypeScript и принял решение переписать весь проект на стек React, TypeScript и SCSS.",
        "Пособие предоставляет удобный и простой в использовании интерфейс, который позволяет пользователям легко найти нужные разделы и главы. Оно структурировано таким образом, чтобы обеспечить логическое и последовательное изучение материала.",
        "Важным аспектом пособия является наличие полезных ссылок на дополнительные материалы, такие как видео, презентации и конспекты. Это расширяет возможности изучения и позволяет участникам семинаров глубже погрузиться в предметную область. Ссылки на дополнительные материалы помогают дополнить основной контент и предоставить дополнительную информацию для более полного понимания тем.",
        "В целом, разработка этого проекта стала важным опытом для меня. Я научился не только создавать пользовательский интерфейс, но и учитывать потребности пользователей, обеспечивая легкую навигацию и доступ к дополнительным ресурсам. Переход на использование TypeScript и SCSS позволил мне улучшить качество кода и обеспечить более эффективное сопровождение проекта в будущем."
      ],
      "deploy": "https://ilyagaltsev.github.io/el-posobie/",
      "github": "https://github.com/IlyaGaltsev/el-posobie",
      "technologies": ["React", "TS", "SCSS"]
    },
    {
      "id": 7,
      "image": "/images/leader.png",
      "title": "ППКПУ Лидер",
      "fullTitle": "Разработка клиентской части для ППКПУ Лидер-А",
      "description": [
        "Прибор приёмно-контрольный пожарный и управления адресно-аналоговый ППКПУ «Лидер-А» представляет собой устройство, разработанное для создания централизованной пожарной сигнализации и систем управления на объектах. Этот прибор объединяет функции прибора приемно-контрольного пожарного и прибора пожарного управления. Он предназначен для контроля и управления пожаротушением, дымоудалением, оповещением и инженерным оборудованием.",
        "Этот проект оказался достаточно интересным и имел свою предысторию. Изначально софт для данного прибора был написан на Delphi. Однако, компания решила добавить новый функционал, и двум программистам, ответственным за разработку, стало трудно справляться с этой задачей. В результате было принято решение обновить стек технологий. Мне была поставлена задача разработать фронтенд для данного устройства. Я выбрал стек React, TypeScript и использовал обычный CSS.",
        "В рамках этого проекта я впервые столкнулся с использованием библиотеки ws и протокола связи MQTT, реализованного через библиотеку paho-mqtt. В данном случае они были необходимы для подписки на события, поступающие от датчиков пожарной охраны, и мгновенного получения этих событий.",
        "Прибор имеет сенсорный экран с фиксированным разрешением 1920px х 1080px, и все приложение работает в одном браузере. Это значительно упростило задачи по разработке фронтенда, так как не требовалось обеспечивать кроссбраузерность и адаптивность под разные размеры экранов. Я разработал интерфейс, который поддерживает минимальное разрешение экрана 1660px х 800px. Благодаря наличию сенсорного экрана в ППКПУ, мне пришлось использовать жесты, и в настоящее время они реализованы в карте помещения.",
        "В целом, работа над этим проектом позволила мне приобрести ценный опыт в разработке фронтенда для устройств сенсорного интерфейса, а так же я получил знания о работе с WebSocket соединения"
      ],
      "deploy": "",
      "github": "",
      "technologies": ["React", "TS", "WS", "PAHO-MQTT"]
    }
  ]
}
